{
  "title":"Приложение для планирования задач",
  "searchResultTitle":"Диасамидзе Таир",
  "pageName":"lecture",
  "pageMode":"DiasamidzeTair",
  "itemList":[
    {
      "type":"Эскиз",
      "title":"Приложение для планирования задач",
      "picture":"img/app/DiasamidzeTair.png"
    },
    {},
    {
      "type":"История",
      "title":"Мне, как пользователю, нужно иметь возможность сортировать задачи по разделам, чтобы видеть только те задачи, которые мне сейчас актуальны."
    },
    {
      "type":"История",
      "title":"Мне, как пользователю, нужно скрывать выполненные задачи, чтобы интерфейс оставался чистым и удобным для работы."
    },
    {
      "type":"История",
      "title":"Мне, как пользователю, нужно создавать новые задачи с указанием названия и описания для фиксации важных дел."
    },
    {
      "type":"История",
      "title":"Мне, как пользователю, нужно редактировать существующие задачи, чтобы обновлять их содержание по мере необходимости."
    },
    {
      "type":"История",
      "title":"Мне, как пользователю, нужно отмечать задачи как выполненные для отслеживания своего прогресса."
    },
    {},
    {
      "type":"История",
      "title":"Мне, как администратору сайта, нужна возможность загрузки приложения для планирования задач."
    },
    {
      "type":"История",
      "title":"Мне, как администратору, нужно удалять неактивные задачи или разделы, чтобы поддерживать порядок в приложении."
    },
    {
      "type":"История",
      "title":"Мне, как администратору сайта, нужна возможность управлять разделами задач, чтобы пользователи могли группировать свои задачи по категориям."
    },
    {
      "type":"История",
      "title":"Мне, как администратору сайта, нужна возможность видеть статистику выполненных и невыполненных задач по всем пользователям, чтобы анализировать их активность."
    },
    {
      "type":"История",
      "title":"Мне, как администратору сайта, нужна возможность создавать глобальные шаблоны задач, чтобы облегчить работу с типовыми задачами."
    },
    {
      "type":"История",
      "title":"Мне, как администратору сайта, нужно удалять неактивные задачи или разделы, чтобы поддерживать порядок в приложении."
    },
    {},
    {
      "type":"История",
      "title":"Мне, как разработчику, нужна функция запуска (AppTaskPlanner) для ее вызова из главной функции."
    },
    {
      "type":"История",
      "title":"Мне, как разработчику, нужна функция сортировки задач (sortTasksBySection) для её вызова из обработчика выбора раздела пользователем."
    },
    {
      "type":"История",
      "title":"Мне, как разработчику, нужна функция создания задачи (createTask) для её вызова из обработчика события нажатия кнопки “Подтверждения создания задачи“."
    },
    {
      "type":"История",
      "title":"Мне, как разработчику, нужна функция скрытия выполненных задач (hideCompletedTasks) для её вызова из обработчика события нажатия кнопки “Скрыть выполненные задачи”."
    },
    {
      "type":"История",
      "title":"Мне, как разработчику, нужна функция редактирования задачи (editTask) для её вызова из обработчика события нажатия кнопки редактирования."
    },
    {
      "type":"История",
      "title":"Мне, как разработчику, нужна функция отметки задачи как выполненной (markTaskAsCompleted) для её вызова из обработчика события изменения состояния кнопки для отметки выполненной задачи."
    },
    {
      "type":"История",
      "title":"Мне, как разработчику, нужна возможность сохранять задачи в localStorage (saveTasksFromLocalStorage) и загружать их при старте (loadTasksFromLocalStorage), чтобы пользователь не терял данные после перезагрузки страницы."
    }
  ]
}